//=============================================================================
//ゲームメイン制御 [game.h]
//Author:渡邉 修	Date:2023.1.19
//=============================================================================
#ifndef _GAME_H_ //インクルードガード(二重定義の防止)
#define _GAME_H_

//===================================================
//プロトタイプ宣言
//===================================================
void InitializeGame(void);
void UpdateGame(void);
void DrawGame(void);
void FinalizeGame(void);

#endif