//=============================================================================
//リザルト [result.h]
//Author:渡邉 修	Date:2023.1.19
//=============================================================================
#ifndef _RESULT_H_ //インクルードガード(二重定義の防止)
#define _RESULT_H_

//===================================================
//プロトタイプ宣言
//===================================================
void InitializeResult(void);
void UpdateResult(void);
void DrawResult(void);
void FinalizeResult(void);

#endif