//=============================================================================
//リザルト [result.cpp]
//Author:渡邉 修	Date:2023.1.19
//=============================================================================
#include "main.h"
#include "result.h"
#include "player.h"
#include "gameControl.h"

#define CONIOEX
#include "conioex.h"

//===================================================
//グローバル変数
//===================================================

//===================================================
//初期化
//===================================================
void InitializeResult(void)
{

}

//===================================================
//更新
//===================================================
void UpdateResult(void)
{
	if (inport(PK_ENTER) || inport(PJ1_BTNS) == 128 || inport(PJ1_BTNS) == 1 || inport(PJ1_BTNS) == 2)
	{
		SetScene(SCENE_TITLE);
	}
}
//===================================================
//描画
//===================================================
void DrawResult(void)
{
	PLAYER player = GetPlayer();

	if (player.stageNum == FINAL_STAGE + 1)
	{
		gotoxy(60, 16);
		printf("記録 : オールクリア!");
		gotoxy(60, 19);
		printf("プレイしていただきありがとうございました。");

		gotoxy(60, 23);
		printf("<ボタンを押してタイトルに戻る>");
	}
	else
	{
		gotoxy(60, 16);
		printf("記録 : ステージ %d 到達!", player.stageNum);
		gotoxy(60, 19);
		printf("プレイしていただきありがとうございました。");

		gotoxy(60, 23);
		printf("<ボタンを押してタイトルに戻る>");
	}
}
//===================================================
//処理
//===================================================
void FinalizeResult(void)
{

}