//===================================================
//スコア制御(score.h)
//Auhor:渡邉 修	Date::2023.1.23
//===================================================
#ifndef _SCORE_H_ //インクルードガード
#define _SCORE_H_

//===================================================
//マクロ定義
//===================================================

//===================================================
//構造体宣言
//===================================================
typedef struct {	//スコア構造体
	float xPos;		//x座標
	float yPos;		//y座標
	int point;		//得点
}SCORE;

//===================================================
//プロトタイプ宣言
//===================================================
void InitializeScore(void);
void UpdateScore(void);
void DrawScore(void);
void FinalizeScore(void);
void SetScore(float px, float py);//初期引数を省略する書き方
void AddScore(int n);

#endif