//=============================================================================
//タイトル [title.h]
//Author:渡邉 修	Date:2023.1.19
//=============================================================================
#ifndef _TITLE_H_ //インクルードガード(二重定義の防止)
#define _TITLE_H_

//===================================================
//プロトタイプ宣言
//===================================================
void InitializeTitle(void);
void UpdateTitle(void);
void DrawTitle(void);
void FinalizeTitle(void);

#endif