/*==============================================================================

   透明なボックス緑(派生) [ClearBoxGreen.cpp]
														 Author : 渡邉 修
														 Date   : 2024/02/11
--------------------------------------------------------------------------------

==============================================================================*/
#include "ClearBoxGreen.h"
#include "Collision.h"
#include "GameWorld.h"

//=============================================================================
// コンストラクタ / デストラクタ
//=============================================================================
ClearBoxGreen::ClearBoxGreen(D3DXVECTOR3 pos, D3DXVECTOR3 rot, GameWorld* gameWorld)
	: Object(pos, rot, D3DXVECTOR3(0.0f, 0.0f, 0.0f), gameWorld)
{
	m_Tag = "ClearBoxGreen";
	m_Scl = (D3DXVECTOR3(1.0f, 1.0f, 1.0f));

	//モデルの設定
	MODEL model = { (char*)"data/MODEL/ClearBoxGreen.obj", new BodyParts(m_Pos, m_Rot, m_Scl, this, true) };
	m_ModelMap["Parts"] = model;

	//モデルの読み込み
	Object::ModelLoad();
}

ClearBoxGreen::~ClearBoxGreen()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
void ClearBoxGreen::Init()
{

}

//=============================================================================
// 終了処理
//=============================================================================
void ClearBoxGreen::Uninit()
{

}

//=============================================================================
// 更新処理
//=============================================================================
void ClearBoxGreen::Update()
{
	//モデル更新
	Object::Update();
}

