/*==============================================================================

   ゲーム処理 [Game.h]
														 Author :
														 Date   :
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "GameSystem.h"
#include "Scene.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class Game : public Scene
{
public:
	Game(SceneManager* sceneManager);
	~Game();

	void Init() override;
	void Uninit() override;
	void Update() override;
	void Draw() override;

	GameSystem GetGameSystem();

private:
	GameSystem m_GameSystem;
	int m_BGM_Sewer = 0;
};

