/*==============================================================================

   ヘッドマン [HeadMan.cpp]
														 Author : 渡邉 修
														 Date   : 2024/01/15
--------------------------------------------------------------------------------

==============================================================================*/
#include "HeadMan.h"
#include "Texture.h"

//=============================================================================
// コンストラクタ / デストラクタ
//=============================================================================
HeadMan::HeadMan(D3DXVECTOR3 pos, D3DXVECTOR3 rot, GameWorld* gameWorld, CAMERA* camera)
	:BillBoard(pos, rot, gameWorld, camera)
{
	m_Tag = "HeadMan";

	//表示大きさ設定
	m_Scl = D3DXVECTOR3(300.0f, 500.0f, 0.0f);

	//テクスチャの設定
	m_TexNo = LoadTexture((char*)"data/TEXTURE/HeadMan.png");

	//モデルの読み込み
	BillBoard::ModelLoad();
}

HeadMan::~HeadMan()
{


}

//=============================================================================
// 初期化
//=============================================================================
HRESULT HeadMan::Init()
{

	
	return E_NOTIMPL;
}

void HeadMan::Update()
{
	Object::Update();
}
