/*==============================================================================

   アイテム [Item.cpp]
														 Author : 渡邉 修
														 Date   : 2024/02/16
--------------------------------------------------------------------------------

==============================================================================*/
#include "Item.h"
#include "Texture.h"

// 静的メンバ変数の定義
int Item::m_sCou = 0;

//=============================================================================
// コンストラクタ / デストラクタ
//=============================================================================
Item::Item(D3DXVECTOR3 pos, D3DXVECTOR3 rot, ITEM_PATTERN pattern, GameWorld* gameWorld, Camera* camera)
	:BillBoard(pos, rot, gameWorld, camera)
{
	m_sCou++;
	m_Tag = "Item";
	m_HitSize.x = 30.0f;//球体で判定するので半径
	m_ItemPattern = pattern;

	//-------------------------------------------------------------//アイテムを追加したらここに追加
	//テクスチャと大きさの設定
	switch (pattern)
	{
	case COIN_GOLD:
	//表示大きさ設定
	m_Scl = D3DXVECTOR3(2.0f, 2.0f, 0.0f);
	//テクスチャの設定
	m_TexNo = LoadTexture((char*)"data/TEXTURE/CoinGold.png");
	break;

	default:
		break;
	}
	//-------------------------------------------------------------//

	//モデルの読み込み
	BillBoard::ModelLoad();
}

Item::~Item()
{

}

//=============================================================================
// 初期化
//=============================================================================
void Item::Init()
{

}

void Item::Update()
{
	Object::Update();
}

