/*==============================================================================

   スコア [Score.cpp]
														 Author :
														 Date   : 
--------------------------------------------------------------------------------

==============================================================================*/
#include "Score.h"
#include "Texture.h"
#include "Sprite.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TEXTURE_WIDTH				(90)	// キャラサイズ
#define TEXTURE_HEIGHT				(90)	// 

//=============================================================================
// コンストラクタ / デストラクタ
//=============================================================================
Score::Score()
{
}

Score::~Score()
{
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT Score::Init(void)
{
	//テクスチャ生成
	m_TexNo = LoadTexture((char*)"data/TEXTURE/Number.png");

	//初期化
	m_WH     = D3DXVECTOR2(TEXTURE_WIDTH, TEXTURE_HEIGHT);
	m_Pos   = D3DXVECTOR3(SCREEN_WIDTH * 0.5f + 50.0f, SCREEN_HEIGHT * 0.2f, 0.0f);

	m_Score = 0;	// スコアの初期化

	return S_OK;
}



//=============================================================================
// 描画処理
//=============================================================================
void Score::Draw(void)
{
	// テクスチャ設定
	GetDeviceContext()->PSSetShaderResources(0, 1, GetTexture(m_TexNo));

	// 桁数分処理する
	int number = m_Score;
	for (int i = 0; i < SCORE_DIGIT; i++)
	{
		// 今回表示する桁の数字
		float x = (float)(number % 10);

		// スコアの位置やテクスチャー座標を反映
		float px = m_Pos.x - m_WH.x * i;	// 表示位置X
		float py = m_Pos.y;				// 表示位置Y
		float pw = m_WH.x;					// 表示幅
		float ph = m_WH.y;					// 表示高さ

		float tw = 1.0f / 10;		// テクスチャの幅
		float th = 1.0f / 1;		// テクスチャの高さ
		float tx = x * tw;			// テクスチャの左上X座標
		float ty = 0.0f;			// テクスチャの左上Y座標

		// １枚のポリゴンの頂点とテクスチャ座標を設定
		DrawSprite(m_TexNo, px, py, pw, ph, tx, ty, tw, th);

		// 次の桁へ
		number /= 10;
	}
}

//=============================================================================
// スコアを加算する
// 引数:add :追加する点数。マイナスも可能
//=============================================================================
void Score::Add(int add)
{
	m_Score += add;

	if (m_Score > SCORE_MAX)
	{
		m_Score = SCORE_MAX;
	}
}

void Score::SetScore(int value)
{
	m_Score = value;
}
